app/controllers/sandwiches_controller.rb

	def show
		sandwich = Sandwich.find_by(id: params[:id])
		unless sandwich
			render json: {error: "sandwich not found"},
			status: 404
			return
		end

		ingredients = sandwich.ingredients.all
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients" INNER JOIN "sandwich_ingredients" ON "ingredients"."id" = "sandwich_ingredients"."ingredient_id" WHERE "sandwich_ingredients"."sandwich_id" = ?  [["sandwich_id", 1]]

	def add_ingredient
		sandwich = Sandwich.find_by(id: params[:sandwich_id])
		unless sandwich
			render json: {error: "sandwich not found"},
			status: 404
			return
		end

		ingredient = Ingredient.find_by(id: params[:ingredient_id])
		unless sandwich
			render json: {error: "sandwich not found"},
			status: 404
			return
		end

		ingredients = sandwich.ingredients.all
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients" INNER JOIN "sandwich_ingredients" ON "ingredients"."id" = "sandwich_ingredients"."ingredient_id" WHERE "sandwich_ingredients"."sandwich_id" = ?  [["sandwich_id", 1]]